### Import Numpy and Pandas

In [ ]:
import numpy as np 
import pandas as pd

### read data

In [2]:
data=pd.read_csv('avocado.csv')

### head of data

In [3]:
data.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

### tail of data

In [4]:
data.tail()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

### information about data

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   Date          18249 non-null  object
 2   AveragePrice  18249 non-null  float64
 3   Total Volume  18249 non-null  float64
 4   4046          18249 non-null  float64
 5   4225          18249 non-null  float64
 6   4770          18249 non-null  float64
 7   Total Bags    18249 non-null  float64
 8   Small Bags    18249 non-null  float64
 9   Large Bags    18249 non-null  float64
 10  XLarge Bags   18249 non-null  float64
 11  type          18249 non-null  object
 12  year          18249 non-null  int64
 13  region        18249 non-null  object
dtypes: float64(9), int64(2), object(3)
memory usage: 1.9+ MB

### data type

In [6]:
data.dtypes

Unnamed: 0        int64
Date             object
AveragePrice    float64
Total Volume    float64
4046            float64
4225            float64
4770            float64
Total Bags      float64
Small Bags      float64
Large Bags      float64
XLarge Bags     float64
type             object
year              int64
region           object
dtype: object

### is null

In [7]:
data.isnull().sum()

Unnamed: 0      0
Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
year            0
region          0
dtype: int64

### Shape

In [31]:
data.shape

(18249, 15)

### describe data

In [8]:
data.describe()

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
count,18249.000000,18249.000000,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,18249.000000,18249.000000
mean,24.232232,1.405978,8.506440e+05,2.930084e+05,2.951546e+05,2.283974e+04,2.396392e+05,1.821947e+05,5.433809e+04,3106.426507,2016.147899
std,15.481045,0.402677,3.453545e+06,1.264989e+06,1.204120e+06,1.074641e+05,9.862424e+05,7.461785e+05,2.439660e+05,17692.894652,0.939938
min,0.000000,0.440000,8.456000e+01,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,2015.000000
25%,10.000000,1.100000,1.083858e+04,8.540700e+02,3.008780e+03,0.000000e+00,5.088640e+03,2.849420e+03,1.274700e+02,0.000000,2015.000000
50%,24.000000,1.370000,1.073768e+05,8.645300e+03,2.906102e+04,1.849900e+02,3.974383e+04,2.636282e+04,2.647710e+03,0.000000,2016.000000
75%,38.000000,1.660000,4.329623e+05,1.110202e+05,1.502069e+05,6.243420e+03,1.107834e+05,8.333767e+04,2.202925e+04,132.500000,2017.000000
max,52.000000,3.250000,6.250565e+07,2.274362e+07,2.047057e+07,2.546439e+06,1.937313e+07,1.338459e+07,5.719097e+06,551693.650000,2018.000000

### Check Duplications

In [30]:
nn=data.drop_duplicates()
len(nn)

18249

# Sample

In [24]:
data.sample(4)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region,years,months
5134,38,2016-04-03,1.05,340564.79,150247.08,97713.54,6435.41,86168.76,63628.30,22540.46,0.00,conventional,2016,SouthCarolina,2016,04
14935,35,2017-04-30,1.22,3943.00,19.93,603.23,0.00,3319.84,496.34,2823.50,0.00,organic,2017,Boise,2017,04
1485,29,2015-06-07,1.32,1731061.12,24734.98,1347902.88,2235.54,356187.72,296939.83,59171.88,76.01,conventional,2015,NewYork,2015,06
5687,18,2017-08-27,1.49,458036.12,230031.71,48132.94,99.72,179771.75,116586.74,56679.85,6505.16,conventional,2017,Atlanta,2017,08

### value_counts

In [9]:
data.type.value_counts()

conventional    9126
organic         9123
Name: type, dtype: int64

In [18]:
categorical_col=data.select_dtypes(include='object')
for col in categorical_col:
    print(data[col].value_counts())
    print('*'*100)

2015-12-27    108
2017-12-24    108
2017-12-10    108
2017-12-03    108
2017-11-26    108
             ...
2016-11-06    108
2018-01-07    108
2017-06-18    107
2017-06-25    107
2015-12-06    107
Name: Date, Length: 169, dtype: int64
****************************************************************************************************
conventional    9126
organic         9123
Name: type, dtype: int64
****************************************************************************************************
Albany                 338
Sacramento             338
Northeast              338
NorthernNewEngland     338
Orlando                338
Philadelphia           338
PhoenixTucson          338
Pittsburgh             338
Plains                 338
Portland               338
RaleighGreensboro      338
RichmondNorfolk        338
Roanoke                338
SanDiego               338
Atlanta                338
SanFrancisco           338
Seattle                338
SouthCarolina          338
SouthCentral           338
Southeast              338
Spokane                338
StLouis                338
Syracuse               338
Tampa                  338
TotalUS                338
West                   338
NewYork                338
NewOrleansMobile       338
Nashville              338
Midsouth               338
BaltimoreWashington    338
Boise                  338
Boston                 338
BuffaloRochester       338
California             338
Charlotte              338
Chicago                338
CincinnatiDayton       338
Columbus               338
DallasFtWorth          338
Denver                 338
Detroit                338
GrandRapids            338
GreatLakes             338
HarrisburgScranton     338
HartfordSpringfield    338
Houston                338
Indianapolis           338
Jacksonville           338
LasVegas               338
LosAngeles             338
Louisville             338
MiamiFtLauderdale      338
WestTexNewMexico       335
Name: region, dtype: int64
****************************************************************************************************

### Series

In [11]:
data2 = pd.Series([0.25, 0.5, 0.75, 1.0],
 index=['a', 'b', 'c', 'd'])

data2

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [12]:
population_dict = {'California': 38332521,
 'Texas': 26448193,
 'New York': 19651127,
 'Florida': 19552860,
 'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

### columns

In [13]:
data.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [15]:
population_dict = {'California': 38332521,
 'Texas': 26448193,
 'New York': 19651127,
 'Florida': 19552860,
 'Illinois': 12882135}

new_data=pd.DataFrame(population, columns=['population'])
new_data

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [16]:
m=pd.DataFrame(np.random.rand(3, 2),
 columns=['foo', 'bar'],
 index=['a', 'b', 'c'])
m

        foo       bar
a  0.113434  0.531910
b  0.370494  0.847703
c  0.355868  0.028105

### Drop Columns

In [27]:
data.drop('Unnamed: 0',axis=1, inplace=True)

In [ ]:
data.drop(data[data['Kilometers_Driven']>100000].index , axis=0 , inplace=True)

In [ ]:
idx = df_f[df_f['Failure Type'] == 'No Failure'].index
df.drop(idx , axis =0 , inplace = True )

## Missing Values

#### 1-Dropna

In [17]:
data.dropna(inplace=True)

#### 2-Fillna

In [ ]:
df.type.fillna(0, inplace = True )

In [ ]:
df.agent.fillna(df.agent.mean() , inplace = True )

In [ ]:
data['occupation_type'].fillna(method="ffill", inplace=True)

### split column

In [21]:
data['years']=data.Date.str.split('-').str[0]
data['months']=data.Date.str.split('-').str[1]

In [22]:
data.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region,years,months
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany,2015,12
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany,2015,12
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany,2015,12
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,2015,12
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,2015,11

### Map Function on columns

In [ ]:
data['Owner_Type']=data['Owner_Type'].map({'First':1 , 'Second':2 , 'Third':3 ,'Fourth & Above':4})

### convert dtypes in columns

In [ ]:
def convert_mileage(mileage):
    try:
        new_mileage=float(mileage.split(" ")[0])
        if mileage.split(" ")[1]=='km/kg':
            new_mileage=new_mileage*0.74
            return new_mileage   
    except:
        return np.nan

In [ ]:
data['Mileage']=data['Mileage'].apply(convert_mileage)

In [ ]:
def family(data):
    if data['adults'] >0 and data['total_childrin']>0:
        return 1
    else:
        return 0
data['family']=data.apply(family , axis=1)

### Pivot Table

In [ ]:
c=pd.pivot_table(data=data ,index='month',columns='year', values='AveragePrice',aggfunc='sum')

In [34]:
corr=data.corr()
corr

C:\Users\Pc\AppData\Local\Temp\ipykernel_8056\2248884307.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  corr=data.corr()

,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
AveragePrice,1.000000,-0.192752,-0.208317,-0.172928,-0.179446,-0.177088,-0.174730,-0.172940,-0.117592,0.093197
Total Volume,-0.192752,1.000000,0.977863,0.974181,0.872202,0.963047,0.967238,0.880640,0.747157,0.017193
4046,-0.208317,0.977863,1.000000,0.926110,0.833389,0.920057,0.925280,0.838645,0.699377,0.003353
4225,-0.172928,0.974181,0.926110,1.000000,0.887855,0.905787,0.916031,0.810015,0.688809,-0.009559
4770,-0.179446,0.872202,0.833389,0.887855,1.000000,0.792314,0.802733,0.698471,0.679861,-0.036531
Total Bags,-0.177088,0.963047,0.920057,0.905787,0.792314,1.000000,0.994335,0.943009,0.804233,0.071552
Small Bags,-0.174730,0.967238,0.925280,0.916031,0.802733,0.994335,1.000000,0.902589,0.806845,0.063915
Large Bags,-0.172940,0.880640,0.838645,0.810015,0.698471,0.943009,0.902589,1.000000,0.710858,0.087891
XLarge Bags,-0.117592,0.747157,0.699377,0.688809,0.679861,0.804233,0.806845,0.710858,1.000000,0.081033
year,0.093197,0.017193,0.003353,-0.009559,-0.036531,0.071552,0.063915,0.087891,0.081033,1.000000

### replace value

In [ ]:
data['TotalCharges']=data['TotalCharges'].replace(" " , x)

In [ ]:
data["code_gender"].replace(['F','M'], [1,0], inplace=True)

### convert dtypes

In [ ]:
data['TotalCharges']=data['TotalCharges'].astype('float')

In [ ]:
df['TotalCharges'] = pd.to_numeric(df['TotalCharges'], errors='coerce')

### get dummies

In [ ]:
df= pd.get_dummies(data=df.num, drop_first=True)

### Cocatination DataFrame

In [ ]:
df3 = pd.concat([df1, df2], axis=1)

### columns lower

In [ ]:
data.columns = data.columns.str.lower()

### Merge

In [ ]:
df = df.merge(credit,how='inner',on=['ID'])

### seprating categorical and numerical columns

In [ ]:
categorical_columns = []
numerical_columns = []
for i in df.columns:
    if df[i].dtype=="O":
        categorical_columns.append(i)
    else:
        numerical_columns.append(i)

### convert object columns into date time

In [ ]:
df.pickup_datetime = pd.to_datetime(df.pickup_datetime, errors='coerce')

In [ ]:
df['pickup_datetime'] = pd.to_datetime(df['pickup_datetime'])

# Extract components into separate columns
df['Year'] = df['pickup_datetime'].dt.year
df['Month'] = df['pickup_datetime'].dt.month
df['Day'] = df['pickup_datetime'].dt.day
df['Day of Week'] = df['pickup_datetime'].dt.dayofweek

### convert latitude ,longitude into distance

In [ ]:
from math import radians, sin, cos, sqrt, atan2

# Function to calculate distance using haversine formula
def calculate_distance(lat1, lon1, lat2, lon2):
    # Convert decimal degrees to radians
    lat1, lon1, lat2, lon2 = map(radians, [lat1, lon1, lat2, lon2])
    
    # Radius of the Earth in kilometers
    R = 6371
    
    # Haversine formula
    dlat = lat2 - lat1
    dlon = lon2 - lon1
    a = sin(dlat / 2) ** 2 + cos(lat1) * cos(lat2) * sin(dlon / 2) ** 2
    c = 2 * atan2(sqrt(a), sqrt(1 - a))
    distance = R * c
    
    return distance

# Calculate distance and store in a new column
df['Distance'] = df.apply(lambda row: calculate_distance(row['pickup_latitude'],
                                                         row['pickup_longitude'],
                                                         row['dropoff_latitude'],
                                                         row['dropoff_longitude']), axis=1)

# <font color='red'> Ahmed Essam